//У контейнері типу vector зберігається набір цілих чисел.
//Створіть функтори для вирішення наступних завдань :
//■ Пошук мінімального значення;
//■ Пошук максимального значення;
//■ Сортування даних за спаданням;
//■ Сортування даних за зростанням;
//■ Збільшення значень в контейнері на задану константу;
//■ Зменшення значень в контейнері на задану константу;
//■ Видалення елементів з контейнера які рівні шуканому значенню.
//Не забувайте використовувати алгоритми там, де це необхідно.

//2. Змініть функтори з першого завдання на шаблонні
//класи - функторів.Перевірте роботу отриманої програми
//на різних контейнерах з різним вмістом.
#include <iostream>
#include<vector>
#include<algorithm>

using namespace std;

class MinElement
{
public:
	int operator ()(int v)
	{

	}
	void foo()
	{
		cout << "i foo dddf" << endl;
	}

private:

};


int main()
{
	vector<int>v = { 10,55,-4,66,8,22,12 };
	

}


